In [37]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree

df = pd.read_csv("OccupancyTrain.csv")

In [38]:
df

        id  Temperature  Humidity  Light         CO2  HumidityRatio Occupied
0        1        23.18   27.2720  426.0  721.250000       0.004793      yes
1        2        23.15   27.2675  429.5  714.000000       0.004783      yes
2        3        23.15   27.2450  426.0  713.500000       0.004779      yes
3        4        23.15   27.2000  426.0  708.250000       0.004772      yes
4        5        23.10   27.2000  426.0  704.500000       0.004757      yes
...    ...          ...       ...    ...         ...            ...      ...
8138  8139        21.05   36.0975  433.0  787.250000       0.005579      yes
8139  8140        21.05   35.9950  433.0  789.500000       0.005563      yes
8140  8141        21.10   36.0950  433.0  798.500000       0.005596      yes
8141  8142        21.10   36.2600  433.0  820.333333       0.005621      yes
8142  8143        21.10   36.2000  447.0  821.000000       0.005612       Y

[8143 rows x 7 columns]

I need to change the categorical values in the Occupied column into numeric values. First I need to check for the unique values in the column so I know what needs to be changed.

In [39]:
df["Occupied"].unique()

array(['yes', 'no', nan, 'Yes', 'Y', 'N ', 'No', 'Y '], dtype=object)

In [40]:
df.isnull().sum()

id               0
Temperature      0
Humidity         0
Light            0
CO2              0
HumidityRatio    0
Occupied         3
dtype: int64

This code showed that there are only 3 null values in the dataset. Since they are in the Occupied column (the variable to be predicted) I am choosing to delete those 3 entries using the dropna function. Since there are over 8,000 rows of data, deleting 3 won't be a significant loss.

In [41]:
df.dropna(axis=0, inplace=True)

In [42]:
# verify the drop worked

df.isnull().sum()

id               0
Temperature      0
Humidity         0
Light            0
CO2              0
HumidityRatio    0
Occupied         0
dtype: int64

In [43]:
# Change categorical values into numeric

df['Occupied'] = df['Occupied'].replace( {'N': 0, 'Y': 1, 'yes': 1, 'no': 0, 'Yes': 1, 'N ': 0, 'No': 0, 'Y ': 1 } ).astype(int)

C:\Users\volde\AppData\Local\Temp\ipykernel_31640\3971087301.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Occupied'] = df['Occupied'].replace( {'N': 0, 'Y': 1, 'yes': 1, 'no': 0, 'Yes': 1, 'N ': 0, 'No': 0, 'Y ': 1 } ).astype(int)

In [44]:
df["Occupied"].unique()

array([1, 0])

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8140 entries, 0 to 8142
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             8140 non-null   int64
 1   Temperature    8140 non-null   float64
 2   Humidity       8140 non-null   float64
 3   Light          8140 non-null   float64
 4   CO2            8140 non-null   float64
 5   HumidityRatio  8140 non-null   float64
 6   Occupied       8140 non-null   int64
dtypes: float64(5), int64(2)
memory usage: 508.8 KB

In [46]:
df.describe()

,id,Temperature,Humidity,Light,CO2,HumidityRatio,Occupied
count,8140.000000,8140.000000,8140.000000,8140.000000,8140.000000,8140.000000,8140.000000
mean,4073.350860,20.618656,25.731379,119.502981,606.533668,0.003862,0.212285
std,2350.195031,1.016853,5.532199,194.738921,314.364389,0.000852,0.408951
min,1.000000,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,2038.750000,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,4073.500000,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,6108.250000,21.390000,30.533333,256.187500,638.750000,0.004352,0.000000
max,8143.000000,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

In [47]:
df.to_csv('Cleaned_Occupancy_Train.csv', index=False)

In [48]:
df.sort_values('Light', ascending=True).tail(10)

,id,Temperature,Humidity,Light,CO2,HumidityRatio,Occupied
1146,1147,22.856667,26.323333,676.000000,1024.750000,0.004535,0
1144,1145,22.722500,26.472500,686.250000,1027.000000,0.004523,1
1112,1113,22.600000,26.790000,688.500000,1100.500000,0.004544,1
1106,1107,22.390000,26.790000,696.500000,1078.000000,0.004486,1
1109,1110,22.472500,26.890000,708.750000,1099.000000,0.004526,1
1143,1144,22.675000,26.525000,732.750000,1038.500000,0.004519,1
1108,1109,22.426667,27.000000,744.000000,1098.333333,0.004531,1
3833,3834,20.760000,18.856667,829.000000,452.666667,0.002850,0
3832,3833,20.745000,18.890000,1451.750000,453.000000,0.002853,0
3831,3832,20.700000,18.890000,1546.333333,455.333333,0.002845,0

In [49]:
df.corr()

,id,Temperature,Humidity,Light,CO2,HumidityRatio,Occupied
id,1.000000,-0.441828,0.642842,-0.121985,0.122380,0.504866,-0.098121
Temperature,-0.441828,1.000000,-0.141825,0.650179,0.560005,0.151627,0.538365
Humidity,0.642842,-0.141825,1.000000,0.037900,0.439068,0.955218,0.133057
Light,-0.121985,0.650179,0.037900,1.000000,0.664013,0.230527,0.907304
CO2,0.122380,0.560005,0.439068,0.664013,1.000000,0.626616,0.712238
HumidityRatio,0.504866,0.151627,0.955218,0.230527,0.626616,1.000000,0.300395
Occupied,-0.098121,0.538365,0.133057,0.907304,0.712238,0.300395,1.000000

In [50]:
df_test = pd.read_csv('OccupancyTest.csv')
df_test

,id,Temperature,Humidity,Light,CO2,HumidityRatio,Occupied
0,140,23.700000,26.272000,585.200000,749.200000,0.004764,yes
1,141,23.718000,26.290000,578.400000,760.400000,0.004773,yes
2,142,23.730000,26.230000,572.666667,769.666667,0.004765,yes
3,143,23.722500,26.125000,493.750000,774.750000,0.004744,yes
4,144,23.754000,26.200000,488.600000,779.000000,0.004767,yes
...,...,...,...,...,...,...,...
2660,2800,24.290000,25.700000,808.000000,1150.250000,0.004829,yes
2661,2801,24.330000,25.736000,809.800000,1129.200000,0.004848,yes
2662,2802,24.330000,25.700000,817.000000,1125.800000,0.004841,yes
2663,2803,24.356667,25.700000,813.000000,1123.000000,0.004849,yes
2664,2804,24.408333,25.681667,798.000000,1124.000000,0.004860,yes

In [51]:
df_test["Occupied"].unique()

array(['yes', 'no'], dtype=object)

In [52]:
df_test['Occupied'] = df_test['Occupied'].replace( {'yes': 1, 'no': 0} ).astype(int)
df_test

C:\Users\volde\AppData\Local\Temp\ipykernel_31640\181672648.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_test['Occupied'] = df_test['Occupied'].replace( {'yes': 1, 'no': 0} ).astype(int)

,id,Temperature,Humidity,Light,CO2,HumidityRatio,Occupied
0,140,23.700000,26.272000,585.200000,749.200000,0.004764,1
1,141,23.718000,26.290000,578.400000,760.400000,0.004773,1
2,142,23.730000,26.230000,572.666667,769.666667,0.004765,1
3,143,23.722500,26.125000,493.750000,774.750000,0.004744,1
4,144,23.754000,26.200000,488.600000,779.000000,0.004767,1
...,...,...,...,...,...,...,...
2660,2800,24.290000,25.700000,808.000000,1150.250000,0.004829,1
2661,2801,24.330000,25.736000,809.800000,1129.200000,0.004848,1
2662,2802,24.330000,25.700000,817.000000,1125.800000,0.004841,1
2663,2803,24.356667,25.700000,813.000000,1123.000000,0.004849,1
2664,2804,24.408333,25.681667,798.000000,1124.000000,0.004860,1

For this dataset, generate three different decision trees using Python.  You can vary the predictors to get three different trees. For each tree:    
•	state the features you considered,  
•	and state the accuracy of the model,  
•	and show the Python statements that you used.

In [59]:
X_train = df[['Light', 'CO2']]
y_train = df[['Occupied']]
X_test = df_test[['Light', 'CO2']]
y_test = df_test[['Occupied']]

In [54]:
X_test

           Light          CO2
0     585.200000   749.200000
1     578.400000   760.400000
2     572.666667   769.666667
3     493.750000   774.750000
4     488.600000   779.000000
...          ...          ...
2660  808.000000  1150.250000
2661  809.800000  1129.200000
2662  817.000000  1125.800000
2663  813.000000  1123.000000
2664  798.000000  1124.000000

[2665 rows x 2 columns]

In [57]:
y_test

      Occupied
0            1
1            1
2            1
3            1
4            1
...        ...
2660         1
2661         1
2662         1
2663         1
2664         1

[2665 rows x 1 columns]

In [60]:
y_train

      Occupied
0            1
1            1
2            1
3            1
4            1
...        ...
8138         1
8139         1
8140         1
8141         1
8142         1

[8140 rows x 1 columns]

In [61]:
dtree_1 = DecisionTreeClassifier(criterion='gini').fit(X_train, y_train)
score_1 = dtree_1.score(X_test, y_test)
score_1

0.924202626641651

In [62]:
dtree_2 = DecisionTreeClassifier(max_depth=5).fit(X_train, y_train)
score_2 = dtree_2.score(X_test, y_test)
score_2

0.9320825515947467

In [64]:
dtree_3 = DecisionTreeClassifier(max_depth=3).fit(X_train, y_train)
score_3 = dtree_3.score(X_test, y_test)
score_3

0.9782363977485928

In [65]:
dot_data = tree.export_graphviz(dtree_3, out_file='OccupiedDecisionTree.dot',
                               feature_names= ['Light', 'CO2'],
                               class_names= ['Unoccuped', 'Occupied'],
                               rounded=True,
                               filled=True)